SET DateStyle TO 'ISO, MDY';
SELECT TO_TIMESTAMP('32-1-1','DD-MM-YYYY');
ERROR:  invalid data for "day of month =  32" ,value must be between 1 and 31
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('31-1-1','DD-MM-YYYY');
    to_timestamp     
---------------------
 0001-01-31 00:00:00
(1 row)

SELECT TO_TIMESTAMP('1-1-1','DD-MM-YYYY');
    to_timestamp     
---------------------
 0001-01-01 00:00:00
(1 row)

SELECT TO_TIMESTAMP('0-1-1','DD-MM-YYYY');
ERROR:  invalid data for "day of month =  0" ,value must be between 1 and 31
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('1-0-1','DD-MM-YYYY');
ERROR:  invalid data for "month =  0" ,value must be between 1 and 12
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('1-1-1','DD-MM-YYYY');
    to_timestamp     
---------------------
 0001-01-01 00:00:00
(1 row)

SELECT TO_TIMESTAMP('1-12-1','DD-MM-YYYY');
    to_timestamp     
---------------------
 0001-12-01 00:00:00
(1 row)

SELECT TO_TIMESTAMP('1-13-1','DD-MM-YYYY');
ERROR:  invalid data for "month =  13" ,value must be between 1 and 12
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('28-2-1','DD-MM-YYYY');
    to_timestamp     
---------------------
 0001-02-28 00:00:00
(1 row)

SELECT TO_TIMESTAMP('29-2-1','DD-MM-YYYY');
ERROR:  invalid data for "day of month =  29" ,value must be be fit for current month
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('29-2-4','DD-MM-YYYY');
    to_timestamp     
---------------------
 0004-02-29 00:00:00
(1 row)

SELECT TO_TIMESTAMP('0-1','DDD-YYYY');
ERROR:  invalid data for "days of year =  0" ,value must be between 1 and 366
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('367-1','DDD-YYYY');
ERROR:  invalid data for "days of year =  367" ,value must be between 1 and 366
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('366-1','DDD-YYYY');
ERROR:  invalid data for "days of year =  366" ,value must be be fit for current year
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('366-4','DDD-YYYY');
    to_timestamp     
---------------------
 0004-12-31 00:00:00
(1 row)

SELECT TO_TIMESTAMP('0','HH12');
ERROR:  invalid data for "hour =  0" ,value must be between 1 and 12
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('1','HH12');
      to_timestamp      
------------------------
 0001-01-01 01:00:00 BC
(1 row)

SELECT TO_TIMESTAMP('12','HH12');
      to_timestamp      
------------------------
 0001-01-01 00:00:00 BC
(1 row)

SELECT TO_TIMESTAMP('13','HH12');
ERROR:  invalid data for "hour =  13" ,value must be between 1 and 12
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('0','HH24');
      to_timestamp      
------------------------
 0001-01-01 00:00:00 BC
(1 row)

SELECT TO_TIMESTAMP('23','HH24');
      to_timestamp      
------------------------
 0001-01-01 23:00:00 BC
(1 row)

SELECT TO_TIMESTAMP('24','HH24');
      to_timestamp      
------------------------
 0001-01-02 00:00:00 BC
(1 row)

SELECT TO_TIMESTAMP('24','H24');
ERROR:  invalid data for match in format string
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('0','MI');
      to_timestamp      
------------------------
 0001-01-01 00:00:00 BC
(1 row)

SELECT TO_TIMESTAMP('59','MI');
      to_timestamp      
------------------------
 0001-01-01 00:59:00 BC
(1 row)

SELECT TO_TIMESTAMP('60','MI');
      to_timestamp      
------------------------
 0001-01-01 01:00:00 BC
(1 row)

SELECT TO_TIMESTAMP('0','SS');
      to_timestamp      
------------------------
 0001-01-01 00:00:00 BC
(1 row)

SELECT TO_TIMESTAMP('59','SS');
      to_timestamp      
------------------------
 0001-01-01 00:00:59 BC
(1 row)

SELECT TO_TIMESTAMP('60','SS');
      to_timestamp      
------------------------
 0001-01-01 00:01:00 BC
(1 row)

SELECT TO_TIMESTAMP('60','DDD-PS');
ERROR:  invalid data for match in format string
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('366-4','YYYY-P');
ERROR:  invalid data for match in format string
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('366-4','YYYY-DD-12');
ERROR:  invalid data for match in format string
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-4713','YYYY');
ERROR:  invalid data for "year =  -4713" ,value must be between 1 and 9999, and not be 0
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-4712','YYYY');
ERROR:  invalid data for "year =  -4712" ,value must be between 1 and 9999, and not be 0
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-1','YYYY');
ERROR:  invalid data for "year =  -1" ,value must be between 1 and 9999, and not be 0
CONTEXT:  referenced column: to_timestamp
select to_timestamp('0','YYYY');
ERROR:  invalid data for "year =  0" ,value must be between 1 and 9999, and not be 0
CONTEXT:  referenced column: to_timestamp
select to_timestamp('1','YYYY');
    to_timestamp     
---------------------
 0001-01-01 00:00:00
(1 row)

select to_timestamp('9999','YYYY');
    to_timestamp     
---------------------
 9999-01-01 00:00:00
(1 row)

select to_timestamp('10000','YYYY');
ERROR:  invalid data for "year =  10000" ,value must be between 1 and 9999, and not be 0
CONTEXT:  referenced column: to_timestamp
select to_timestamp('10','H24');
ERROR:  invalid data for match in format string
CONTEXT:  referenced column: to_timestamp
select to_timestamp('10','H24');
ERROR:  invalid data for match in format string
CONTEXT:  referenced column: to_timestamp
SELECT to_timestamp('-2012-2/3,21.15;36:18','YYYY-MM/DD,HH24.MI;SS:FF');
ERROR:  invalid data for "year =  -2012" ,value must be between 1 and 9999, and not be 0
CONTEXT:  referenced column: to_timestamp
SELECT to_timestamp('-1-2/3,21.15;36:18','YYYY-MM/DD,HH24.MI;SS:FF');
ERROR:  invalid data for "year =  -1" ,value must be between 1 and 9999, and not be 0
CONTEXT:  referenced column: to_timestamp
SELECT to_timestamp('0-2/3,21.15;36:18','YYYY-MM/DD,HH24.MI;SS:FF');
ERROR:  invalid data for "year =  0" ,value must be between 1 and 9999, and not be 0
CONTEXT:  referenced column: to_timestamp
SELECT to_timestamp('9999-2/3,21.15;36:18','YYYY-MM/DD,HH24.MI;SS:FF');
      to_timestamp      
------------------------
 9999-02-03 21:15:36.18
(1 row)

SELECT to_timestamp('10000-2/3,21.15;36:18','YYYY-MM/DD,HH24.MI;SS:FF');
ERROR:  invalid data for "year =  10000" ,value must be between 1 and 9999, and not be 0
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-4713-3-4 13:2:3.234015', 'syyyy-mm-dd hh24:mi:ss.ff');
ERROR:  invalid data for "year =  -4713" ,value must be between -4712 and 9999, and not be 0
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-4712-3-4 13:2:3.234015', 'syyyy-mm-dd hh24:mi:ss.ff');
         to_timestamp          
-------------------------------
 4712-03-04 13:02:03.234015 BC
(1 row)

select to_timestamp('0-3-4 13:2:3.234015', 'syyyy-mm-dd hh24:mi:ss.ff');
ERROR:  invalid data for "year =  0" ,value must be between -4712 and 9999, and not be 0
CONTEXT:  referenced column: to_timestamp
select to_timestamp('9999-3-4 13:2:3.234015', 'syyyy-mm-dd hh24:mi:ss.ff');
        to_timestamp        
----------------------------
 9999-03-04 13:02:03.234015
(1 row)

select to_timestamp('10000-3-4 13:2:3.234015', 'syyyy-mm-dd hh24:mi:ss.ff');
ERROR:  invalid data for "year =  10000" ,value must be between -4712 and 9999, and not be 0
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-4713-3-4 13:2:3.234015', 'SYYYY-mm-dd hh24:mi:ss.ff');
ERROR:  invalid data for "year =  -4713" ,value must be between -4712 and 9999, and not be 0
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-4712-3-4 13:2:3.234015', 'SYYYY-mm-dd hh24:mi:ss.ff');
         to_timestamp          
-------------------------------
 4712-03-04 13:02:03.234015 BC
(1 row)

select to_timestamp('0-3-4 13:2:3.234015', 'SYYYY-mm-dd hh24:mi:ss.ff');
ERROR:  invalid data for "year =  0" ,value must be between -4712 and 9999, and not be 0
CONTEXT:  referenced column: to_timestamp
select to_timestamp('9999-3-4 13:2:3.234015', 'SYYYY-mm-dd hh24:mi:ss.ff');
        to_timestamp        
----------------------------
 9999-03-04 13:02:03.234015
(1 row)

select to_timestamp('10000-3-4 13:2:3.234015', 'SYYYY-mm-dd hh24:mi:ss.ff');
ERROR:  invalid data for "year =  10000" ,value must be between -4712 and 9999, and not be 0
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-4713-3-4 13:2:3.234015', 'RR-mm-dd hh24:mi:ss.ff');
ERROR:  invalid data for "year(RR/RRRR) =  -4713" ,value must be between 0 and 9999
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-4712-3-4 13:2:3.234015', 'RR-mm-dd hh24:mi:ss.ff');
ERROR:  invalid data for "year(RR/RRRR) =  -4712" ,value must be between 0 and 9999
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-1-3-4 13:2:3.234015', 'RR-mm-dd hh24:mi:ss.ff');
ERROR:   RR/RRRR should be between 0 - 9999
CONTEXT:  referenced column: to_timestamp
select to_timestamp('0-3-4 13:2:3.234015', 'RR-mm-dd hh24:mi:ss.ff');
        to_timestamp        
----------------------------
 2000-03-04 13:02:03.234015
(1 row)

select to_timestamp('1-3-4 13:2:3.234015', 'RR-mm-dd hh24:mi:ss.ff');
        to_timestamp        
----------------------------
 2001-03-04 13:02:03.234015
(1 row)

select to_timestamp('9999-3-4 13:2:3.234015', 'RR-mm-dd hh24:mi:ss.ff');
        to_timestamp        
----------------------------
 9999-03-04 13:02:03.234015
(1 row)

select to_timestamp('10000-3-4 13:2:3.234015', 'RR-mm-dd hh24:mi:ss.ff');
ERROR:  invalid data for "year(RR/RRRR) =  10000" ,value must be between 0 and 9999
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-4713-3-4 13:2:3.234015', 'RRRR-mm-dd hh24:mi:ss.ff');
ERROR:  invalid data for "year(RR/RRRR) =  -4713" ,value must be between 0 and 9999
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-4712-3-4 13:2:3.234015', 'RRRR-mm-dd hh24:mi:ss.ff');
ERROR:  invalid data for "year(RR/RRRR) =  -4712" ,value must be between 0 and 9999
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-1-3-4 13:2:3.234015', 'RRRR-mm-dd hh24:mi:ss.ff');
ERROR:   RR/RRRR should be between 0 - 9999
CONTEXT:  referenced column: to_timestamp
select to_timestamp('0-3-4 13:2:3.234015', 'RRRR-mm-dd hh24:mi:ss.ff');
        to_timestamp        
----------------------------
 2000-03-04 13:02:03.234015
(1 row)

select to_timestamp('1-3-4 13:2:3.234015', 'RRRR-mm-dd hh24:mi:ss.ff');
        to_timestamp        
----------------------------
 2001-03-04 13:02:03.234015
(1 row)

select to_timestamp('9999-3-4 13:2:3.234015', 'RRRR-mm-dd hh24:mi:ss.ff');
        to_timestamp        
----------------------------
 9999-03-04 13:02:03.234015
(1 row)

select to_timestamp('10000-3-4 13:2:3.234015', 'RRRR-mm-dd hh24:mi:ss.ff');
ERROR:  invalid data for "year(RR/RRRR) =  10000" ,value must be between 0 and 9999
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-4713-3-4 13:2:3.234015', 'rr-mm-dd hh24:mi:ss.ff');
ERROR:  invalid data for "year(RR/RRRR) =  -4713" ,value must be between 0 and 9999
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-4712-3-4 13:2:3.234015', 'rr-mm-dd hh24:mi:ss.ff');
ERROR:  invalid data for "year(RR/RRRR) =  -4712" ,value must be between 0 and 9999
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-1-3-4 13:2:3.234015', 'rr-mm-dd hh24:mi:ss.ff');
ERROR:   RR/RRRR should be between 0 - 9999
CONTEXT:  referenced column: to_timestamp
select to_timestamp('0-3-4 13:2:3.234015', 'rr-mm-dd hh24:mi:ss.ff');
        to_timestamp        
----------------------------
 2000-03-04 13:02:03.234015
(1 row)

select to_timestamp('1-3-4 13:2:3.234015', 'rr-mm-dd hh24:mi:ss.ff');
        to_timestamp        
----------------------------
 2001-03-04 13:02:03.234015
(1 row)

select to_timestamp('9999-3-4 13:2:3.234015', 'rr-mm-dd hh24:mi:ss.ff');
        to_timestamp        
----------------------------
 9999-03-04 13:02:03.234015
(1 row)

select to_timestamp('10000-3-4 13:2:3.234015', 'rr-mm-dd hh24:mi:ss.ff');
ERROR:  invalid data for "year(RR/RRRR) =  10000" ,value must be between 0 and 9999
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-4713-3-4 13:2:3.234015', 'rrrr-mm-dd hh24:mi:ss.ff');
ERROR:  invalid data for "year(RR/RRRR) =  -4713" ,value must be between 0 and 9999
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-4712-3-4 13:2:3.234015', 'rrrr-mm-dd hh24:mi:ss.ff');
ERROR:  invalid data for "year(RR/RRRR) =  -4712" ,value must be between 0 and 9999
CONTEXT:  referenced column: to_timestamp
select to_timestamp('-1-3-4 13:2:3.234015', 'rrrr-mm-dd hh24:mi:ss.ff');
ERROR:   RR/RRRR should be between 0 - 9999
CONTEXT:  referenced column: to_timestamp
select to_timestamp('0-3-4 13:2:3.234015', 'rrrr-mm-dd hh24:mi:ss.ff');
        to_timestamp        
----------------------------
 2000-03-04 13:02:03.234015
(1 row)

select to_timestamp('1-3-4 13:2:3.234015', 'rrrr-mm-dd hh24:mi:ss.ff');
        to_timestamp        
----------------------------
 2001-03-04 13:02:03.234015
(1 row)

select to_timestamp('9999-3-4 13:2:3.234015', 'rrrr-mm-dd hh24:mi:ss.ff');
        to_timestamp        
----------------------------
 9999-03-04 13:02:03.234015
(1 row)

select to_timestamp('10000-3-4 13:2:3.234015', 'rrrr-mm-dd hh24:mi:ss.ff');
ERROR:  invalid data for "year(RR/RRRR) =  10000" ,value must be between 0 and 9999
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('0000-09-01','YYYYY-MM-DD');
ERROR:  conflicting values for "Y" field in formatting string
DETAIL:  This value contradicts a previous setting for the same field type.
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('0000-09-01','SYYYYY-MM-DD');
ERROR:  invalid value "0000-" for "SYYYY"
DETAIL:  Field requires 5 characters, but only 4 could be parsed.
HINT:  If your source string is not fixed-width, try using the "FM" modifier.
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('0000-09-01','SYYYY-Y-MM-DD');
ERROR:  conflicting values for "Y" field in formatting string
DETAIL:  This value contradicts a previous setting for the same field type.
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('25361','SSSSS');
      to_timestamp      
------------------------
 0001-01-01 07:02:41 BC
(1 row)

SELECT TO_TIMESTAMP('25361-2','SSSSS-HH12');
ERROR:  hour conflicts with seconds in day
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('25361-07','SSSSS-HH12');
      to_timestamp      
------------------------
 0001-01-01 07:02:41 BC
(1 row)

SELECT TO_TIMESTAMP('25361-2','SSSSS-MI');
      to_timestamp      
------------------------
 0001-01-01 07:02:41 BC
(1 row)

SELECT TO_TIMESTAMP('25361-10','SSSSS-MI');
ERROR:   minutes of hour conflicts with seconds in day
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('25361-2','SSSSS-SS');
ERROR:   seconds of minute conflicts with seconds in day
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('25361-41','SSSSS-SS');
      to_timestamp      
------------------------
 0001-01-01 07:02:41 BC
(1 row)

SELECT TO_TIMESTAMP('2650000','J');
    to_timestamp     
---------------------
 2543-05-09 00:00:00
(1 row)

SELECT TO_TIMESTAMP('2650000-2542','J-YYYY');
ERROR:  year conflicts with Julian date
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('2650000-2543','J-YYYY');
    to_timestamp     
---------------------
 2543-05-09 00:00:00
(1 row)

SELECT TO_TIMESTAMP('2650000-4','J-MM');
ERROR:  month conflicts with Julian date
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('2650000-5','J-MM');
    to_timestamp     
---------------------
 2543-05-09 00:00:00
(1 row)

SELECT TO_TIMESTAMP('2650000-8','J-DD');
ERROR:  day conflicts with Julian date
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('2650000-9','J-DD');
    to_timestamp     
---------------------
 2543-05-09 00:00:00
(1 row)

SELECT TO_TIMESTAMP('2012-245','YYYY-DDD');
    to_timestamp     
---------------------
 2012-09-01 00:00:00
(1 row)

SELECT TO_TIMESTAMP('2012-245-8','YYYY-DDD-MM');
ERROR:  month conflicts with days of year
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('2012-245-9','YYYY-DDD-MM');
    to_timestamp     
---------------------
 2012-09-01 00:00:00
(1 row)

SELECT TO_TIMESTAMP('2012-245-1','YYYY-DDD-DD');
    to_timestamp     
---------------------
 2012-09-01 00:00:00
(1 row)

SELECT TO_TIMESTAMP('2012-245-2','YYYY-DDD-DD');
ERROR:  days of month conflicts with days of year
CONTEXT:  referenced column: to_timestamp
--MS
SELECT TO_TIMESTAMP('-1','MS');
ERROR:  invalid data for "millisecond =  -10" ,value must be between 0 and 999
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('0','MS');
      to_timestamp      
------------------------
 0001-01-01 00:00:00 BC
(1 row)

SELECT TO_TIMESTAMP('256','MS');
        to_timestamp        
----------------------------
 0001-01-01 00:00:00.256 BC
(1 row)

SELECT TO_TIMESTAMP('999','MS');
        to_timestamp        
----------------------------
 0001-01-01 00:00:00.999 BC
(1 row)

SELECT TO_TIMESTAMP('1000','MS');
ERROR:  invalid data for "millisecond =  1000" ,value must be between 0 and 999
CONTEXT:  referenced column: to_timestamp
--WW
SELECT TO_TIMESTAMP('0','WW');
ERROR:  invalid data for "week number of year =  0" ,value must be between 1 and 53
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('1','WW');
ERROR:  cannot calculate day of year without year information
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('10','WW');
ERROR:  cannot calculate day of year without year information
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('53','WW');
ERROR:  cannot calculate day of year without year information
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('54','WW');
ERROR:  invalid data for "week number of year =  54" ,value must be between 1 and 53
CONTEXT:  referenced column: to_timestamp
--D
SELECT TO_TIMESTAMP('0','D');
ERROR:  invalid data for "day =  0" ,value must be between 1 and 7
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('1','D');
      to_timestamp      
------------------------
 0001-01-01 00:00:00 BC
(1 row)

SELECT TO_TIMESTAMP('4','D');
      to_timestamp      
------------------------
 0001-01-01 00:00:00 BC
(1 row)

SELECT TO_TIMESTAMP('7','D');
      to_timestamp      
------------------------
 0001-01-01 00:00:00 BC
(1 row)

SELECT TO_TIMESTAMP('8','D');
ERROR:  invalid data for "day =  8" ,value must be between 1 and 7
CONTEXT:  referenced column: to_timestamp
--WW & D YYYY
SELECT TO_TIMESTAMP('2012-50-0','YYYY-WW-D');
ERROR:  invalid data for "day =  0" ,value must be between 1 and 7
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('2012-50-1','YYYY-WW-D');
    to_timestamp     
---------------------
 2012-12-09 00:00:00
(1 row)

SELECT TO_TIMESTAMP('2012-50-4','YYYY-WW-D');
    to_timestamp     
---------------------
 2012-12-09 00:00:00
(1 row)

SELECT TO_TIMESTAMP('2012-50-7','YYYY-WW-D');
    to_timestamp     
---------------------
 2012-12-09 00:00:00
(1 row)

SELECT TO_TIMESTAMP('2012-50-8','YYYY-WW-D');
ERROR:  invalid data for "day =  8" ,value must be between 1 and 7
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('2012-0-4','YYYY-WW-D');
ERROR:  invalid data for "week number of year =  0" ,value must be between 1 and 53
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('2012-1-4','YYYY-WW-D');
    to_timestamp     
---------------------
 2012-01-01 00:00:00
(1 row)

SELECT TO_TIMESTAMP('2012-50-4','YYYY-WW-D');
    to_timestamp     
---------------------
 2012-12-09 00:00:00
(1 row)

SELECT TO_TIMESTAMP('2012-53-4','YYYY-WW-D');
    to_timestamp     
---------------------
 2012-12-30 00:00:00
(1 row)

SELECT TO_TIMESTAMP('2012-54-4','YYYY-WW-D');
ERROR:  invalid data for "week number of year =  54" ,value must be between 1 and 53
CONTEXT:  referenced column: to_timestamp
--US
SELECT TO_TIMESTAMP('-1','US');
ERROR:  invalid data for "microsecond =  -10000" ,value must be between 1 and 999999
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('0','US');
      to_timestamp      
------------------------
 0001-01-01 00:00:00 BC
(1 row)

SELECT TO_TIMESTAMP('99999','US');
         to_timestamp         
------------------------------
 0001-01-01 00:00:00.99999 BC
(1 row)

SELECT TO_TIMESTAMP('999999','US');
         to_timestamp          
-------------------------------
 0001-01-01 00:00:00.999999 BC
(1 row)

SELECT TO_TIMESTAMP('1000000','US');
ERROR:  input length of format 'US'/'us'/'FF'/'ff' must between 0 and 6
CONTEXT:  referenced column: to_timestamp
--W
SELECT TO_TIMESTAMP('-1','W');
ERROR:  invalid data for "week of month  =  -1" ,value must be between 1 and 5
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('0','W');
ERROR:  invalid data for "week of month  =  0" ,value must be between 1 and 5
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('1','W');
      to_timestamp      
------------------------
 0001-01-01 00:00:00 BC
(1 row)

SELECT TO_TIMESTAMP('5','W');
      to_timestamp      
------------------------
 0001-01-29 00:00:00 BC
(1 row)

SELECT TO_TIMESTAMP('6','W');
ERROR:  invalid data for "week of month  =  6" ,value must be between 1 and 5
CONTEXT:  referenced column: to_timestamp
SHOW nls_timestamp_format;
    nls_timestamp_format    
----------------------------
 DD-Mon-YYYY HH:MI:SS.FF AM
(1 row)

SELECT TO_TIMESTAMP('01');
      to_timestamp      
------------------------
 0001-01-01 00:00:00 BC
(1 row)

SELECT TO_TIMESTAMP('01-Sep');
      to_timestamp      
------------------------
 0001-09-01 00:00:00 BC
(1 row)

SELECT TO_TIMESTAMP('01-Sep-1998');
    to_timestamp     
---------------------
 1998-09-01 00:00:00
(1 row)

SELECT TO_TIMESTAMP('01-Sep-1998 11');
    to_timestamp     
---------------------
 1998-09-01 11:00:00
(1 row)

SELECT TO_TIMESTAMP('01-Sep-1998 11:12');
    to_timestamp     
---------------------
 1998-09-01 11:12:00
(1 row)

SELECT TO_TIMESTAMP('01-Sep-1998 11:12:13');
    to_timestamp     
---------------------
 1998-09-01 11:12:13
(1 row)

SELECT TO_TIMESTAMP('01-Sep-1998 11:12:13.12');
      to_timestamp      
------------------------
 1998-09-01 11:12:13.12
(1 row)

SELECT TO_TIMESTAMP('01-Sep-1998 11:12:13.12 PM');
      to_timestamp      
------------------------
 1998-09-01 23:12:13.12
(1 row)

SELECT TO_TIMESTAMP('01-Sep-1998 11:12:13 PM');
ERROR:  invalid value "PM" for "FF"
DETAIL:  Value must be an integer.
CONTEXT:  referenced column: to_timestamp
SET nls_timestamp_format = 'YYYY-MM-DD HH:MI:SS.FF AM';
SHOW nls_timestamp_format;
   nls_timestamp_format    
---------------------------
 YYYY-MM-DD HH:MI:SS.FF AM
(1 row)

SELECT TO_TIMESTAMP('1998');
    to_timestamp     
---------------------
 1998-01-01 00:00:00
(1 row)

SELECT TO_TIMESTAMP('1998-12-28');
    to_timestamp     
---------------------
 1998-12-28 00:00:00
(1 row)

SELECT TO_TIMESTAMP('1998-12-28 01');
    to_timestamp     
---------------------
 1998-12-28 01:00:00
(1 row)

SELECT TO_TIMESTAMP('1998-12-28 01:02');
    to_timestamp     
---------------------
 1998-12-28 01:02:00
(1 row)

SELECT TO_TIMESTAMP('1998-12-28 01:02:03');
    to_timestamp     
---------------------
 1998-12-28 01:02:03
(1 row)

SELECT TO_TIMESTAMP('1998-12-28 01:02:03.12');
      to_timestamp      
------------------------
 1998-12-28 01:02:03.12
(1 row)

SELECT TO_TIMESTAMP('1998-12-28 01:02:03.12 AM');
      to_timestamp      
------------------------
 1998-12-28 01:02:03.12
(1 row)

SELECT TO_TIMESTAMP('1998-12-28 11:12:13 PM');
ERROR:  invalid value "PM" for "FF"
DETAIL:  Value must be an integer.
CONTEXT:  referenced column: to_timestamp
SELECT TO_TIMESTAMP('01');
    to_timestamp     
---------------------
 0001-01-01 00:00:00
(1 row)

select to_date('2018--12;30', 'yyyy//mm/,,dd');
       to_date       
---------------------
 2018-12-30 00:00:00
(1 row)

select to_date('2018-12  30', 'yyyy//mm/dd');
       to_date       
---------------------
 2018-12-30 00:00:00
(1 row)

select to_date('20181231124559','yyyy-MM-dd hh24:mi:ss'); 
       to_date       
---------------------
 2018-12-31 12:45:59
(1 row)

SELECT (TO_DATE('1999(12*23 12  26','yyyy-MM-dd hh24:mi:ss'));   
       to_date       
---------------------
 1999-12-23 12:26:00
(1 row)

SELECT (TO_DATE('1999(12*23 12    26','yyyy-MM-dd hh24:mi:ss'));      
       to_date       
---------------------
 1999-12-23 12:26:00
(1 row)

SELECT (TO_DATE('1999(12*23 12
26','yyyy-MM-dd hh24:mi:ss'));      
       to_date       
---------------------
 1999-12-23 12:26:00
(1 row)

SELECT to_date('10', 'SSSSS');
        to_date         
------------------------
 0001-01-01 00:00:10 BC
(1 row)

SELECT TO_TIMESTAMP('01', 'yyyy-MM-dd'); 
    to_timestamp     
---------------------
 0001-01-01 00:00:00
(1 row)

SELECT TO_CHAR(TO_DATE('27OCT17', 'DDMONRR') ,'YYYY') "Year";
 Year 
------
 2017
(1 row)

SELECT TO_CHAR(TO_DATE('27-OCT98', 'DD-MON-RR') ,'YYYY') "Year";
 Year 
------
 1998
(1 row)

SELECT TO_CHAR(TO_DATE('27DEC98', 'DDMON-RR') ,'MON') "Month";
 Month 
-------
 DEC
(1 row)

SELECT TO_CHAR(TO_DATE('27/OCT/17', 'DD-MON-RR') ,'DD') "Year";
 Year 
------
 27
(1 row)

SELECT to_date('aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa                              aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa                              aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa aaaaaaaaaaaaaaaaaaaaaaaaaaaa                              aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa                              aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa                              aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa                              aaaaaaaaaaaaaaaaaaaaaaaaaaa        aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa                              aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa                              aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa                              aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa                                                11111');
ERROR:  the format is not correct
CONTEXT:  referenced column: to_date
SELECT to_date('aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa                              aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa                              aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa aaaaaaaaaaaaaaaaaaaaaaaaaaaa                              aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa                              aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa                              aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa                              aaaaaaaaaaaaaaaaaaaaaaaaaaa        aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa                              aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa                              aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa                              aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 11111');
ERROR:  the format is not correct
CONTEXT:  referenced column: to_date
SELECT TO_CHAR(timestamp '2021-08-30 21:21:55.535744', 'YYYYMMDDHH24MISSFF1');
     to_char     
-----------------
 202108302121555
(1 row)

SELECT TO_CHAR(timestamp '2021-08-30 21:21:55.535744', 'YYYYMMDDHH24MISSFF2');
     to_char      
------------------
 2021083021215553
(1 row)

SELECT TO_CHAR(timestamp '2021-08-30 21:21:55.535744', 'YYYYMMDDHH24MISSFF3');
      to_char      
-------------------
 20210830212155535
(1 row)

SELECT TO_CHAR(timestamp '2021-08-30 21:21:55.535744', 'YYYYMMDDHH24MISSFF4');
      to_char       
--------------------
 202108302121555357
(1 row)

SELECT TO_CHAR(timestamp '2021-08-30 21:21:55.535744', 'YYYYMMDDHH24MISSFF5');
       to_char       
---------------------
 2021083021215553574
(1 row)

SELECT TO_CHAR(timestamp '2021-08-30 21:21:55.535744', 'YYYYMMDDHH24MISSFF6');
       to_char        
----------------------
 20210830212155535744
(1 row)

SELECT TO_CHAR(timestamptz '2021-08-30 21:21:55.535744+08', 'YYYYMMDDHH24MISSFF1');
     to_char     
-----------------
 202108300621555
(1 row)

SELECT TO_CHAR(timestamptz '2021-08-30 21:21:55.535744+08', 'YYYYMMDDHH24MISSFF2');
     to_char      
------------------
 2021083006215553
(1 row)

SELECT TO_CHAR(timestamptz '2021-08-30 21:21:55.535744+08', 'YYYYMMDDHH24MISSFF3');
      to_char      
-------------------
 20210830062155535
(1 row)

SELECT TO_CHAR(timestamptz '2021-08-30 21:21:55.535744+08', 'YYYYMMDDHH24MISSFF4');
      to_char       
--------------------
 202108300621555357
(1 row)

SELECT TO_CHAR(timestamptz '2021-08-30 21:21:55.535744+08', 'YYYYMMDDHH24MISSFF5');
       to_char       
---------------------
 2021083006215553574
(1 row)

SELECT TO_CHAR(timestamptz '2021-08-30 21:21:55.535744+08', 'YYYYMMDDHH24MISSFF6');
       to_char        
----------------------
 20210830062155535744
(1 row)

SELECT TO_CHAR(timestamp '2021-08-30 21:21:55.535744', 'yyyymmddhh24missff1');
     to_char     
-----------------
 202108302121555
(1 row)

SELECT TO_CHAR(timestamp '2021-08-30 21:21:55.535744', 'yyyymmddhh24missff2');
     to_char      
------------------
 2021083021215553
(1 row)

SELECT TO_CHAR(timestamp '2021-08-30 21:21:55.535744', 'yyyymmddhh24missff3');
      to_char      
-------------------
 20210830212155535
(1 row)

SELECT TO_CHAR(timestamp '2021-08-30 21:21:55.535744', 'yyyymmddhh24missff4');
      to_char       
--------------------
 202108302121555357
(1 row)

SELECT TO_CHAR(timestamp '2021-08-30 21:21:55.535744', 'yyyymmddhh24missff5');
       to_char       
---------------------
 2021083021215553574
(1 row)

SELECT TO_CHAR(timestamp '2021-08-30 21:21:55.535744', 'yyyymmddhh24missff6');
       to_char        
----------------------
 20210830212155535744
(1 row)

SELECT TO_CHAR(timestamptz '2021-08-30 21:21:55.535744+08', 'yyyymmddhh24missff1');
     to_char     
-----------------
 202108300621555
(1 row)

SELECT TO_CHAR(timestamptz '2021-08-30 21:21:55.535744+08', 'yyyymmddhh24missff2');
     to_char      
------------------
 2021083006215553
(1 row)

SELECT TO_CHAR(timestamptz '2021-08-30 21:21:55.535744+08', 'yyyymmddhh24missff3');
      to_char      
-------------------
 20210830062155535
(1 row)

SELECT TO_CHAR(timestamptz '2021-08-30 21:21:55.535744+08', 'yyyymmddhh24missff4');
      to_char       
--------------------
 202108300621555357
(1 row)

SELECT TO_CHAR(timestamptz '2021-08-30 21:21:55.535744+08', 'yyyymmddhh24missff5');
       to_char       
---------------------
 2021083006215553574
(1 row)

SELECT TO_CHAR(timestamptz '2021-08-30 21:21:55.535744+08', 'yyyymmddhh24missff6');
       to_char        
----------------------
 20210830062155535744
(1 row)

SELECT TO_CHAR(timestamp '2021-08-30 21:21:55.535744', 'YYYYMMDDHH24MISSXFF');
        to_char        
-----------------------
 20210830212155.535744
(1 row)

SELECT TO_CHAR(timestamptz '2021-08-30 21:21:55.535744+08', 'YYYYMMDDHH24MISSXFF');
        to_char        
-----------------------
 20210830062155.535744
(1 row)

SELECT TO_CHAR(timestamp '2021-08-30 21:21:55.535744', 'yyyymmddhh24missxff');
        to_char        
-----------------------
 20210830212155.535744
(1 row)

SELECT TO_CHAR(timestamptz '2021-08-30 21:21:55.535744+08', 'yyyymmddhh24missxff');
        to_char        
-----------------------
 20210830062155.535744
(1 row)

set timezone='Asia/Beijing';
select extract(timezone from now());
 date_part 
-----------
     28800
(1 row)

declare
    current_time_beijing  timestamptz;
    current_time_other      timestamptz;
begin
    set timezone='Asia/Beijing';
    current_time_beijing = transaction_timestamp();
    set timezone='UTC';
    current_time_other = transaction_timestamp();
    raise notice '%', age(current_time_beijing, current_time_other);
    set timezone='Asia/Shanghai';
    current_time_other = transaction_timestamp();
    raise notice '%', age(current_time_beijing, current_time_other);
    set timezone='Asia/Chongqing';
    current_time_other = transaction_timestamp();
    raise notice '%', age(current_time_beijing, current_time_other);
	
	set timezone to default;
end;
/
NOTICE:  @ 0
NOTICE:  @ 0
NOTICE:  @ 0
